[
  {
    "id": "1",
    "text": "Elon Musk is a genius! Tesla stock going through the roof. Best electric cars ever made. We need more innovators like him in America!",
    "createdAt": "2024-01-15T14:30:00Z",
    "likeCount": 125000,
    "retweetCount": 45000
  },
  {
    "id": "2",
    "text": "Just met with @elonmusk about AI and the future of technology. Very smart guy. America will lead the world in AI and robotics!",
    "createdAt": "2024-01-20T10:15:00Z",
    "likeCount": 98000,
    "retweetCount": 35000
  },
  {
    "id": "3",
    "text": "Electric vehicles are the future but we need to protect American jobs. Tesla builds great cars IN AMERICA. That's what we need!",
    "createdAt": "2024-01-25T16:45:00Z",
    "likeCount": 87000,
    "retweetCount": 28000
  },
  {
    "id": "4",
    "text": "The radical left wants to force everyone into electric cars. Not good for our great oil industry! But Tesla makes it work with American innovation.",
    "createdAt": "2024-02-01T09:00:00Z",
    "likeCount": 92000,
    "retweetCount": 31000
  },
  {
    "id": "5",
    "text": "SpaceX launching more rockets than any country! Elon Musk shows what private enterprise can do. NASA should take notes!",
    "createdAt": "2024-02-10T11:30:00Z",
    "likeCount": 115000,
    "retweetCount": 42000
  },
  {
    "id": "6",
    "text": "Artificial Intelligence is very powerful. We must make sure America, not China, leads in AI. Working with our tech leaders including @elonmusk!",
    "createdAt": "2024-02-15T13:20:00Z",
    "likeCount": 103000,
    "retweetCount": 38000
  },
  {
    "id": "7",
    "text": "Tesla Cybertruck is incredible! Built like a tank. American engineering at its finest. Order books are full!",
    "createdAt": "2024-02-20T15:10:00Z",
    "likeCount": 94000,
    "retweetCount": 33000
  },
  {
    "id": "8",
    "text": "Some people don't like Elon because he speaks his mind. I respect that! Free speech is important. Tesla stock up big today!",
    "createdAt": "2024-02-25T12:00:00Z",
    "likeCount": 108000,
    "retweetCount": 39000
  },
  {
    "id": "9",
    "text": "The fake news media attacks Elon Musk just like they attack me. He's doing great things for America with Tesla and SpaceX!",
    "createdAt": "2024-03-01T14:45:00Z",
    "likeCount": 121000,
    "retweetCount": 44000
  },
  {
    "id": "10",
    "text": "Self-driving cars will be huge. Tesla leading the way. But we need proper regulations to keep people safe!",
    "createdAt": "2024-03-05T10:30:00Z",
    "likeCount": 76000,
    "retweetCount": 25000
  },
  {
    "id": "11",
    "text": "China trying to steal our AI and robotics technology. We must protect American innovation. Companies like Tesla must be careful!",
    "createdAt": "2024-03-10T16:20:00Z",
    "likeCount": 89000,
    "retweetCount": 32000
  },
  {
    "id": "12",
    "text": "Electric vehicle tax credits are a disaster. But Tesla doesn't need them - they make great products that people want to buy!",
    "createdAt": "2024-03-15T11:15:00Z",
    "likeCount": 83000,
    "retweetCount": 29000
  },
  {
    "id": "13",
    "text": "Neuralink could help so many people. Elon Musk pushing boundaries of what's possible. FDA needs to move faster on approvals!",
    "createdAt": "2024-03-20T13:50:00Z",
    "likeCount": 91000,
    "retweetCount": 34000
  },
  {
    "id": "14",
    "text": "Tesla factory in Texas is MASSIVE! Creating thousands of American jobs. This is how you bring manufacturing back!",
    "createdAt": "2024-03-25T15:30:00Z",
    "likeCount": 97000,
    "retweetCount": 36000
  },
  {
    "id": "15",
    "text": "Some say EVs aren't ready. Tesla proves them wrong every day. American innovation beats government mandates!",
    "createdAt": "2024-03-30T09:45:00Z",
    "likeCount": 85000,
    "retweetCount": 30000
  },
  {
    "id": "16",
    "text": "Robots will take some jobs but create new ones. We need to prepare. Tesla's robot project very interesting!",
    "createdAt": "2024-04-05T12:10:00Z",
    "likeCount": 72000,
    "retweetCount": 24000
  },
  {
    "id": "17",
    "text": "Met with auto executives today. Tesla way ahead on technology. Traditional automakers need to step up!",
    "createdAt": "2024-04-10T14:00:00Z",
    "likeCount": 88000,
    "retweetCount": 31500
  },
  {
    "id": "18",
    "text": "Starlink providing internet to rural America. Another Elon Musk success story. Better than government programs!",
    "createdAt": "2024-04-15T10:20:00Z",
    "likeCount": 95000,
    "retweetCount": 35500
  },
  {
    "id": "19",
    "text": "AI regulation is coming. We must be smart about it. Can't let China win this race. Tesla's AI is incredible!",
    "createdAt": "2024-04-20T16:40:00Z",
    "likeCount": 79000,
    "retweetCount": 27000
  },
  {
    "id": "20",
    "text": "Battery technology is key to America's future. Tesla leading the charge. We need more Gigafactories!",
    "createdAt": "2024-04-25T11:55:00Z",
    "likeCount": 81000,
    "retweetCount": 28500
  }
]